# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "schniz/tap"

# Binaries
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'tree'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"

# Casks
cask '1password'
cask '1password-cli'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'visual-studio-code'
cask 'vlc'
cask 'kitty'
cask 'notion'
cask 'postman'

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-3270-nerd-font"